Белгипрозем_2017/src/DataProcessors/мВыгрузкаЗП/мВыгрузкаЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>мВыгрузкаЗП</name>
</mdclass:DataProcessor>

Белгипрозем_2017/src/AccumulationRegisters/НачисленаЗП/НачисленаЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НачисленаЗП</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНачисления</name>
    <type>
      <types>CatalogRef.мВидыНачислений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.мВидыЭкономическойДеятельности</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Белгипрозем_2017/src/InformationRegisters/СведенияОПользователях/СведенияОПользователях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОПользователях</name>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>Ранг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/DataProcessors/мВыгрузкаЗП/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ФайлВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогВыбораФайла.Заголовок = "Выберите Файл";
	ДиалогВыбораФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'DBF'; en = 'DBF'") + "(*.dbf)|*.dbf";
	ДиалогВыбораФайла.Фильтр = Фильтр;

	Если ДиалогВыбораФайла.Выбрать() Тогда
		ФайлВыгрузки = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&НачПер КАК MES,
		|	НачисленаЗПОбороты.СуммаОборот КАК SUM,
		|	НачисленаЗПОбороты.ЧасыОборот КАК CHAS,
		|	НачисленаЗПОбороты.Исполнитель.ТабельныйНомер КАК KOD,
		|	НачисленаЗПОбороты.Исполнитель.Наименование КАК NAME,
		|	НачисленаЗПОбороты.Подразделение.Наименование КАК NAMEPD,
		|	НачисленаЗПОбороты.Подразделение.Код КАК KODPD,
		|	НачисленаЗПОбороты.ВидНачисления.Код КАК KODVR,
		|	НачисленаЗПОбороты.ВидНачисления.Наименование КАК NAMEVR,
		|	НачисленаЗПОбороты.ВидДеятельности.Код КАК KODVD,
		|	НачисленаЗПОбороты.ВидДеятельности.Наименование КАК NAMEVD,
		|	СведенияОПользователях.Должность.Наименование КАК NAMEDOLG
		|ИЗ
		|	РегистрНакопления.НачисленаЗП.Обороты(&НачПер, &КонПер, Период, Подразделение = &Подразделение) КАК НачисленаЗПОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПользователях КАК СведенияОПользователях
		|		ПО НачисленаЗПОбороты.Исполнитель = СведенияОПользователях.Пользователь";
	
	Запрос.УстановитьПараметр("КонПер", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачПер", Период.ДатаНачала);
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Подразделение = &Подразделение", "");	
	КонецЕсли; 
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВДанныеФормы(Результат, ТЗ);
КонецПроцедуры

&НаКлиенте
Функция СоздатьФайлДБФ()
	НовыйФайл = Новый XBase;
	НовыйФайл.Кодировка = КодировкаXBase.ANSI;
	НовыйФайл.Поля.Добавить("MES","D");
	НовыйФайл.Поля.Добавить("SUM","N",15,2);
	НовыйФайл.Поля.Добавить("CHAS","N",10,2) ;
	НовыйФайл.Поля.Добавить("KOD","S",10) ;
	НовыйФайл.Поля.Добавить("NAME","S",150) ;
	НовыйФайл.Поля.Добавить("NAMEPD","S",150) ;
	НовыйФайл.Поля.Добавить("KODPD","S",10) ;
	НовыйФайл.Поля.Добавить("KODVR","S",10) ;
	НовыйФайл.Поля.Добавить("NAMEVR","S",150) ;
	НовыйФайл.Поля.Добавить("KODVD","S",10) ;
	НовыйФайл.Поля.Добавить("NAMEVD","S",150) ;
	НовыйФайл.Поля.Добавить("NAMEDOLG","S",150) ;
	
	НовыйФайл.СоздатьФайл(ФайлВыгрузки);
	Возврат НовыйФайл;
КонецФункции 

&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере();
	
	ФайлДБФ = СоздатьФайлДБФ();
	
	Для каждого Стр Из ТЗ Цикл
		ФайлДБФ.Добавить();	
		ЗаполнитьЗначенияСвойств(ФайлДБФ, Стр);
		ФайлДБФ.Записать();
	КонецЦикла; 
	
	Если ФайлДБФ.Открыта() Тогда
		ФайлДБФ.ЗакрытьФайл();	
	КонецЕсли; 
	ПоказатьОповещениеПользователя("Данные выгружены!"); 
КонецПроцедуры
